[
  {
    "title": "Dell Inspiron 15",
    "price": 799,
    "stock": 50,
    "reviews": [],
    "brand": "Dell",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Dell Inspiron 15 is a reliable laptop with a powerful Intel Core processor and ample storage. It is designed for productivity and entertainment, making it perfect for students, professionals, and home users alike. With its sleek and modern design, this laptop is sure to turn heads wherever you go. The vibrant display provides crisp and clear visuals, whether you're watching movies, browsing the web, or working on spreadsheets. The keyboard is comfortable to type on for extended periods, and the touchpad is responsive and accurate. With long battery life, you can work or play all day without having to worry about charging. Overall, the Dell Inspiron 15 offers excellent performance, reliability, and value for money, making it a top choice for anyone in need of a new laptop.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Apple MacBook Pro 13",
    "price": 1299,
    "stock": 40,
    "reviews": [],
    "brand": "Apple",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Apple MacBook Pro 13 is a premium laptop with stunning Retina display and powerful performance. It is meticulously crafted from high-quality materials, ensuring durability and elegance. Whether you're a creative professional, a student, or a business user, this laptop is designed to meet your needs. The Retina display offers vibrant colors and sharp details, making it ideal for photo and video editing, graphic design, and watching movies. The powerful Intel Core processor delivers lightning-fast performance, allowing you to multitask with ease. With its slim and lightweight design, you can take it with you wherever you go. The macOS operating system is intuitive and user-friendly, providing a seamless experience. With long battery life and fast charging, you can stay productive all day long. Overall, the Apple MacBook Pro 13 is a powerhouse of a laptop that offers unparalleled performance and versatility.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Samsung Galaxy S22",
    "price": 999,
    "stock": 60,
    "reviews": [],
    "brand": "Samsung",
    "category": "smartphone",
    "photos": [],
    "displayImage": "",
    "description": "The Samsung Galaxy S22 is the latest flagship smartphone from Samsung, packed with cutting-edge features and innovations. With its stunning Infinity-O display, you can enjoy immersive visuals and vibrant colors like never before. The powerful Exynos processor delivers lightning-fast performance, allowing you to multitask with ease and run even the most demanding apps and games without any lag. The triple-camera setup lets you capture stunning photos and videos in any lighting conditions, while the advanced AI features help you take your creativity to the next level. With 5G connectivity, you can enjoy blazing-fast internet speeds and seamless streaming and downloading. The sleek and stylish design of the Samsung Galaxy S22 makes it a true head-turner, while the long-lasting battery ensures that you can stay connected all day long. Whether you're a professional, a student, or a tech enthusiast, the Samsung Galaxy S22 is the perfect smartphone for you.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Sony WH-1000XM4",
    "price": 349,
    "stock": 30,
    "reviews": [],
    "brand": "Sony",
    "category": "headphone",
    "photos": [],
    "displayImage": "",
    "description": "The Sony WH-1000XM4 is the ultimate wireless noise-canceling headphone, designed to deliver unparalleled audio quality and comfort. With its industry-leading noise-canceling technology, you can block out distractions and immerse yourself in your favorite music, movies, and podcasts with stunning clarity and detail. The adaptive sound control feature automatically adjusts the sound settings based on your activity and surroundings, ensuring optimal sound quality wherever you go. The ergonomic design and plush ear cushions provide all-day comfort, while the long battery life ensures that you can enjoy your music for hours on end. Whether you're commuting, traveling, or just relaxing at home, the Sony WH-1000XM4 is the perfect companion for all your audio needs.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Rolex Submariner",
    "price": 9500,
    "stock": 10,
    "reviews": [],
    "brand": "Rolex",
    "category": "watch",
    "photos": [],
    "displayImage": "",
    "description": "The Rolex Submariner is a true icon of luxury watchmaking, renowned for its timeless design, precision craftsmanship, and unmatched performance. With its classic yet contemporary styling, this legendary timepiece exudes elegance and sophistication, making it the perfect accessory for any occasion. The Submariner's robust construction and water-resistant design make it suitable for diving, while its automatic movement ensures reliable and accurate timekeeping. The iconic Oyster case and bracelet are crafted from the finest materials, including stainless steel and 18kt gold, ensuring durability and longevity. Whether you're a seasoned collector or a first-time buyer, the Rolex Submariner is sure to make a statement and elevate your style to new heights.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "HP Pavilion Desktop",
    "price": 699,
    "stock": 20,
    "reviews": [],
    "brand": "HP",
    "category": "desktop",
    "photos": [],
    "displayImage": "",
    "description": "The HP Pavilion Desktop is a powerful and versatile desktop computer that offers exceptional performance and reliability for both work and play. With its sleek and modern design, this desktop is perfect for any home or office environment. The powerful Intel Core processor delivers smooth and responsive performance, allowing you to multitask with ease and run demanding applications without any slowdowns. The spacious hard drive provides ample storage space for all your files, photos, and videos, while the high-definition display delivers stunning visuals and vibrant colors. Whether you're a professional, a student, or a casual user, the HP Pavilion Desktop is the perfect choice for all your computing needs.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Canon EOS 90D",
    "price": 1199,
    "stock": 15,
    "reviews": [],
    "brand": "Canon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Canon EOS 90D is a high-performance DSLR camera that offers advanced features and versatility for both photography and videography. With its 32.5-megapixel APS-C CMOS sensor and DIGIC 8 image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The fast and accurate autofocus system ensures sharp focus, even in challenging lighting conditions, while the high-speed continuous shooting mode lets you capture fast-moving subjects with ease. The vari-angle touchscreen LCD makes it easy to compose shots from any angle, while the built-in Wi-Fi and Bluetooth connectivity allow you to share your photos and videos instantly with friends and family. Whether you're a beginner or an experienced photographer, the Canon EOS 90D is the perfect tool to unleash your creativity and take your photography to the next level.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Nike Air Force 1",
    "price": 100,
    "stock": 100,
    "reviews": [],
    "brand": "Nike",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Nike Air Force 1 is a classic sneaker that has stood the test of time, beloved by sneakerheads and fashionistas alike. With its iconic design and timeless appeal, this sneaker is a must-have addition to any wardrobe. The durable leather upper provides long-lasting comfort and support, while the Air-Sole unit in the heel delivers lightweight cushioning for all-day comfort. The low-cut silhouette and padded collar offer a snug and secure fit, while the rubber outsole provides traction and durability on any surface. Whether you're hitting the streets or just chilling with friends, the Nike Air Force 1 is the perfect choice for effortless style and unbeatable comfort.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Amazon Echo Dot (4th Gen)",
    "price": 49,
    "stock": 50,
    "reviews": [],
    "brand": "Amazon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Amazon Echo Dot (4th Gen) is a smart speaker that packs a powerful punch in a compact package. With its sleek and stylish design, this speaker blends seamlessly into any room decor, while its advanced technology delivers crystal-clear sound and immersive audio experience. The built-in Alexa voice assistant lets you control your smart home devices, play music, set reminders, and much more, all with just your voice. Whether you're listening to your favorite playlist, checking the weather, or getting the latest news updates, the Amazon Echo Dot (4th Gen) is the perfect companion for your everyday life.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "LG OLED C1 65-Inch TV",
    "price": 2299,
    "stock": 20,
    "reviews": [],
    "brand": "LG",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The LG OLED C1 65-Inch TV is a state-of-the-art television that offers stunning picture quality, immersive sound, and smart features for an unparalleled viewing experience. With its OLED display technology, this TV delivers perfect blacks, vibrant colors, and infinite contrast, bringing movies, shows, and games to life like never before. The α9 Gen 4 AI processor analyzes and enhances every scene in real time, ensuring sharp detail and smooth motion for a truly cinematic experience. The built-in Dolby Atmos audio system delivers immersive sound that fills the room, while the webOS smart platform lets you access your favorite streaming services, apps, and more with ease. Whether you're watching movies, gaming, or just relaxing with friends and family, the LG OLED C1 65-Inch TV is the ultimate entertainment hub for your home.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Adidas Ultraboost 21",
    "price": 180,
    "stock": 80,
    "reviews": [],
    "brand": "Adidas",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Adidas Ultraboost 21 is a premium running shoe that offers unparalleled comfort, support, and performance for runners of all levels. With its responsive Boost midsole and flexible Primeknit upper, this shoe delivers a smooth and cushioned ride with every step. The 3D heel frame provides stability and support, while the Continental Rubber outsole offers superior traction and durability on any surface. Whether you're hitting the pavement or the trails, the Adidas Ultraboost 21 is the perfect choice for your next run.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Microsoft Surface Pro 8",
    "price": 999,
    "stock": 30,
    "reviews": [],
    "brand": "Microsoft",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Microsoft Surface Pro 8 is a versatile 2-in-1 laptop that offers the power of a laptop and the versatility of a tablet in one sleek and portable device. With its vibrant PixelSense display and powerful Intel Core processor, this device delivers stunning visuals and lightning-fast performance for work, play, and everything in between. The detachable keyboard and Surface Pen (sold separately) let you switch seamlessly between laptop and tablet mode, while the adjustable kickstand allows you to find the perfect angle for typing, drawing, or watching movies. With all-day battery life and Windows 11 pre-installed, the Microsoft Surface Pro 8 is the perfect companion for productivity on the go.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Bose QuietComfort Earbuds",
    "price": 279,
    "stock": 40,
    "reviews": [],
    "brand": "Bose",
    "category": "headphone",
    "photos": [],
    "displayImage": "",
    "description": "The Bose QuietComfort Earbuds are premium true wireless earbuds that offer industry-leading noise cancellation and exceptional sound quality in a sleek and compact design. With their advanced ANC technology, these earbuds block out distractions and immerse you in your music, allowing you to focus and stay productive in any environment. The custom-designed drivers deliver deep, clear, and balanced sound, while the StayHear Max tips provide a secure and comfortable fit for all-day wear. Whether you're commuting, working out, or just relaxing at home, the Bose QuietComfort Earbuds are the perfect companion for your audio needs.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Samsung Galaxy Watch 4",
    "price": 349,
    "stock": 30,
    "reviews": [],
    "brand": "Samsung",
    "category": "watch",
    "photos": [],
    "displayImage": "",
    "description": "The Samsung Galaxy Watch 4 is a stylish and feature-packed smartwatch that helps you stay connected, motivated, and healthy throughout the day. With its sleek and modern design, this watch looks great on any wrist, while its vibrant AMOLED display provides crystal-clear visuals and easy navigation. The advanced health monitoring features track your heart rate, sleep patterns, and activity levels, giving you valuable insights into your overall well-being. With built-in GPS and 5ATM water resistance, you can track your workouts and outdoor adventures with confidence, while the long-lasting battery ensures that you can go all day without having to recharge. Whether you're at work, at the gym, or out and about, the Samsung Galaxy Watch 4 is the perfect companion for your active lifestyle.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Lenovo Legion 5 Gaming Laptop",
    "price": 1199,
    "stock": 20,
    "reviews": [],
    "brand": "Lenovo",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Lenovo Legion 5 Gaming Laptop is a powerful and affordable gaming laptop that offers high-performance gaming without breaking the bank. With its AMD Ryzen processor and NVIDIA GeForce graphics, this laptop delivers smooth and immersive gameplay with stunning visuals and responsive controls. The fast refresh rate and low response time ensure smooth and tear-free gaming, while the dual-channel memory and spacious SSD provide ample storage and fast load times for all your favorite games. Whether you're a casual gamer or a hardcore enthusiast, the Lenovo Legion 5 Gaming Laptop is the perfect choice for gaming on the go.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Canon EOS R5",
    "price": 3899,
    "stock": 10,
    "reviews": [],
    "brand": "Canon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Canon EOS R5 is a professional-grade mirrorless camera that offers unrivaled performance and versatility for photographers and videographers alike. With its 45-megapixel full-frame CMOS sensor and DIGIC X image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The advanced autofocus system with deep learning technology ensures fast and accurate subject tracking, while the in-body image stabilization system provides up to 8 stops of shake correction for sharp and steady handheld shooting. Whether you're shooting stills or videos, the Canon EOS R5 is the ultimate tool for capturing stunning visuals and telling compelling stories.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Ray-Ban Wayfarer Sunglasses",
    "price": 169,
    "stock": 50,
    "reviews": [],
    "brand": "Ray-Ban",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Ray-Ban Wayfarer Sunglasses are an iconic accessory that never goes out of style. With their timeless design and superior craftsmanship, these sunglasses are a must-have addition to any wardrobe. The classic Wayfarer shape flatters all face shapes, while the durable acetate frame provides long-lasting durability and comfort. The polarized lenses offer 100% UV protection, reducing glare and protecting your eyes from harmful rays. Whether you're hitting the beach, driving around town, or just hanging out with friends, the Ray-Ban Wayfarer Sunglasses are the perfect choice for effortless style and unbeatable sun protection.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Apple iPad Air (4th Gen)",
    "price": 599,
    "stock": 40,
    "reviews": [],
    "brand": "Apple",
    "category": "tablet",
    "photos": [],
    "displayImage": "",
    "description": "The Apple iPad Air (4th Gen) is a powerful and versatile tablet that offers the perfect balance of portability and performance. With its stunning Liquid Retina display and powerful A14 Bionic chip, this iPad delivers immersive visuals and lightning-fast performance for work, play, and everything in between. The sleek and lightweight design makes it easy to take with you wherever you go, while the Touch ID fingerprint sensor ensures secure and convenient access to your device. Whether you're browsing the web, watching movies, or sketching ideas, the Apple iPad Air (4th Gen) is the perfect companion for your everyday life.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Garmin Fenix 7",
    "price": 799,
    "stock": 30,
    "reviews": [],
    "brand": "Garmin",
    "category": "watch",
    "photos": [],
    "displayImage": "",
    "description": "The Garmin Fenix 7 is a premium multisport GPS watch that offers advanced features and durability for outdoor enthusiasts and athletes. With its rugged design and MIL-STD-810G certification, this watch is built to withstand the toughest conditions, whether you're hiking, trail running, or mountain biking. The advanced GPS and GLONASS navigation systems provide accurate tracking and mapping, while the wrist-based heart rate monitor and pulse ox sensor help you monitor your health and fitness levels in real time. With smart notifications, music streaming, and customizable watch faces, the Garmin Fenix 7 is the ultimate companion for your active lifestyle.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Levi's 501 Original Fit Jeans",
    "price": 59,
    "stock": 60,
    "reviews": [],
    "brand": "Levi's",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Levi's 501 Original Fit Jeans are a timeless classic that never goes out of style. With their iconic straight-leg silhouette and rugged denim construction, these jeans are a wardrobe staple for men and women alike. The button fly and five-pocket styling add to the vintage-inspired look, while the mid-rise waist and relaxed fit provide all-day comfort and versatility. Whether you're dressing up or keeping it casual, the Levi's 501 Original Fit Jeans are the perfect choice for effortless style and timeless appeal.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "GoPro HERO 10 Black",
    "price": 499,
    "stock": 30,
    "reviews": [],
    "brand": "GoPro",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The GoPro HERO 10 Black is the ultimate action camera for capturing epic adventures and adrenaline-fueled moments. With its stunning 5.3K video resolution and advanced HyperSmooth 4.0 stabilization, this camera delivers silky-smooth footage that's sure to impress. The powerful GP2 processor ensures fast and responsive performance, allowing you to capture every detail with clarity and precision. With built-in Wi-Fi and Bluetooth connectivity, you can easily share your photos and videos with friends and family, while the rugged and waterproof design lets you take it anywhere your adventures take you. Whether you're surfing, skiing, or skydiving, the GoPro HERO 10 Black is the perfect companion for your next adventure.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Nike Air Jordan 1",
    "price": 170,
    "stock": 40,
    "reviews": [],
    "brand": "Nike",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Nike Air Jordan 1 is a legendary basketball shoe that has transcended the court to become a cultural icon. With its iconic high-top silhouette and classic Air Jordan branding, this sneaker is a must-have for sneakerheads and collectors alike. The premium leather upper provides durability and support, while the Air-Sole unit in the heel delivers lightweight cushioning for all-day comfort. Whether you're rocking them on the court or the streets, the Nike Air Jordan 1 is sure to turn heads and make a statement wherever you go.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Sony PlayStation 5",
    "price": 499,
    "stock": 20,
    "reviews": [],
    "brand": "Sony",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Sony PlayStation 5 is the next-generation gaming console that takes gaming to a whole new level with its stunning graphics, lightning-fast load times, and immersive gameplay experiences. With its powerful custom-designed CPU and GPU, this console delivers breathtaking visuals and smooth performance for even the most demanding games. The lightning-fast SSD storage ensures lightning-fast load times and seamless transitions between levels, while the integrated Tempest 3D AudioTech delivers immersive sound that puts you right in the middle of the action. Whether you're a casual gamer or a hardcore enthusiast, the Sony PlayStation 5 is the ultimate gaming console for your living room.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Fitbit Charge 5",
    "price": 179,
    "stock": 40,
    "reviews": [],
    "brand": "Fitbit",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Fitbit Charge 5 is a premium fitness tracker that helps you stay motivated, track your progress, and reach your health and fitness goals. With its sleek and stylish design, this tracker looks great on any wrist, while its advanced features provide valuable insights into your overall health and well-being. The built-in GPS lets you track your outdoor activities with precision, while the heart rate monitor and SpO2 sensor monitor your heart rate and blood oxygen levels throughout the day. With up to 7 days of battery life and water resistance up to 50 meters, the Fitbit Charge 5 is the perfect companion for your active lifestyle.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Microsoft Xbox Series X",
    "price": 499,
    "stock": 20,
    "reviews": [],
    "brand": "Microsoft",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Microsoft Xbox Series X is the most powerful and immersive gaming console ever created, delivering stunning graphics, lightning-fast load times, and unparalleled performance for gamers of all levels. With its custom-designed CPU and GPU, this console delivers breathtaking visuals and smooth gameplay for even the most demanding games. The lightning-fast SSD storage ensures quick load times and seamless transitions between levels, while the innovative Xbox Velocity Architecture ensures smooth and responsive gaming experiences. Whether you're playing the latest AAA titles or revisiting classic favorites, the Microsoft Xbox Series X is the ultimate gaming console for your living room.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Canon EOS R6",
    "price": 2499,
    "stock": 10,
    "reviews": [],
    "brand": "Canon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Canon EOS R6 is a professional-grade mirrorless camera that offers advanced features and versatility for photographers and videographers alike. With its 20-megapixel full-frame CMOS sensor and DIGIC X image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The advanced autofocus system with deep learning technology ensures fast and accurate subject tracking, while the in-body image stabilization system provides up to 8 stops of shake correction for sharp and steady handheld shooting. Whether you're shooting stills or videos, the Canon EOS R6 is the ultimate tool for capturing stunning visuals and telling compelling stories.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Bose SoundLink Revolve+",
    "price": 299,
    "stock": 30,
    "reviews": [],
    "brand": "Bose",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Bose SoundLink Revolve+ is a portable Bluetooth speaker that delivers immersive 360-degree sound and deep, powerful bass in a compact and durable design. With its seamless aluminum body and water-resistant construction, this speaker is built to withstand the rigors of outdoor adventures and poolside parties. The rechargeable battery provides up to 17 hours of playtime on a single charge, while the built-in speakerphone lets you take calls hands-free with crystal-clear sound. Whether you're lounging at home, hosting a barbecue, or hitting the beach, the Bose SoundLink Revolve+ is the perfect companion for your music.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Sony WH-1000XM4",
    "price": 349,
    "stock": 30,
    "reviews": [],
    "brand": "Sony",
    "category": "headphone",
    "photos": [],
    "displayImage": "",
    "description": "The Sony WH-1000XM4 is the ultimate wireless noise-canceling headphone, designed to deliver unparalleled audio quality and comfort. With its industry-leading noise-canceling technology, you can block out distractions and immerse yourself in your favorite music, movies, and podcasts with stunning clarity and detail. The adaptive sound control feature automatically adjusts the sound settings based on your activity and surroundings, ensuring optimal sound quality wherever you go. The ergonomic design and plush ear cushions provide all-day comfort, while the long battery life ensures that you can enjoy your music for hours on end. Whether you're commuting, traveling, or just relaxing at home, the Sony WH-1000XM4 is the perfect companion for all your audio needs.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Rolex Submariner",
    "price": 9500,
    "stock": 10,
    "reviews": [],
    "brand": "Rolex",
    "category": "watch",
    "photos": [],
    "displayImage": "",
    "description": "The Rolex Submariner is a true icon of luxury watchmaking, renowned for its timeless design, precision craftsmanship, and unmatched performance. With its classic yet contemporary styling, this legendary timepiece exudes elegance and sophistication, making it the perfect accessory for any occasion. The Submariner's robust construction and water-resistant design make it suitable for diving, while its automatic movement ensures reliable and accurate timekeeping. The iconic Oyster case and bracelet are crafted from the finest materials, including stainless steel and 18kt gold, ensuring durability and longevity. Whether you're a seasoned collector or a first-time buyer, the Rolex Submariner is sure to make a statement and elevate your style to new heights.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "HP Pavilion Desktop",
    "price": 699,
    "stock": 20,
    "reviews": [],
    "brand": "HP",
    "category": "desktop",
    "photos": [],
    "displayImage": "",
    "description": "The HP Pavilion Desktop is a powerful and versatile desktop computer that offers exceptional performance and reliability for both work and play. With its sleek and modern design, this desktop is perfect for any home or office environment. The powerful Intel Core processor delivers smooth and responsive performance, allowing you to multitask with ease and run demanding applications without any slowdowns. The spacious hard drive provides ample storage space for all your files, photos, and videos, while the high-definition display delivers stunning visuals and vibrant colors. Whether you're a professional, a student, or a casual user, the HP Pavilion Desktop is the perfect choice for all your computing needs.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Canon EOS 90D",
    "price": 1199,
    "stock": 15,
    "reviews": [],
    "brand": "Canon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Canon EOS 90D is a high-performance DSLR camera that offers advanced features and versatility for both photography and videography. With its 32.5-megapixel APS-C CMOS sensor and DIGIC 8 image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The fast and accurate autofocus system ensures sharp focus, even in challenging lighting conditions, while the high-speed continuous shooting mode lets you capture fast-moving subjects with ease. The vari-angle touchscreen LCD makes it easy to compose shots from any angle, while the built-in Wi-Fi and Bluetooth connectivity allow you to share your photos and videos instantly with friends and family. Whether you're a beginner or an experienced photographer, the Canon EOS 90D is the perfect tool to unleash your creativity and take your photography to the next level.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Nike Air Force 1",
    "price": 100,
    "stock": 100,
    "reviews": [],
    "brand": "Nike",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Nike Air Force 1 is a classic sneaker that has stood the test of time, beloved by sneakerheads and fashionistas alike. With its iconic design and timeless appeal, this sneaker is a must-have addition to any wardrobe. The durable leather upper provides long-lasting comfort and support, while the Air-Sole unit in the heel delivers lightweight cushioning for all-day comfort. The low-cut silhouette and padded collar offer a snug and secure fit, while the rubber outsole provides traction and durability on any surface. Whether you're hitting the streets or just chilling with friends, the Nike Air Force 1 is the perfect choice for effortless style and unbeatable comfort.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Amazon Echo Dot (4th Gen)",
    "price": 49,
    "stock": 50,
    "reviews": [],
    "brand": "Amazon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Amazon Echo Dot (4th Gen) is a smart speaker that packs a powerful punch in a compact package. With its sleek and stylish design, this speaker blends seamlessly into any room decor, while its advanced technology delivers crystal-clear sound and immersive audio experience. The built-in Alexa voice assistant lets you control your smart home devices, play music, set reminders, and much more, all with just your voice. Whether you're listening to your favorite playlist, checking the weather, or getting the latest news updates, the Amazon Echo Dot (4th Gen) is the perfect companion for your everyday life.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "LG OLED C1 65-Inch TV",
    "price": 2299,
    "stock": 20,
    "reviews": [],
    "brand": "LG",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The LG OLED C1 65-Inch TV is a state-of-the-art television that offers stunning picture quality, immersive sound, and smart features for an unparalleled viewing experience. With its OLED display technology, this TV delivers perfect blacks, vibrant colors, and infinite contrast, bringing movies, shows, and games to life like never before. The α9 Gen 4 AI processor analyzes and enhances every scene in real time, ensuring sharp detail and smooth motion for a truly cinematic experience. The built-in Dolby Atmos audio system delivers immersive sound that fills the room, while the webOS smart platform lets you access your favorite streaming services, apps, and more with ease. Whether you're watching movies, gaming, or just relaxing with friends and family, the LG OLED C1 65-Inch TV is the ultimate entertainment hub for your home.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Adidas Ultraboost 21",
    "price": 180,
    "stock": 80,
    "reviews": [],
    "brand": "Adidas",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Adidas Ultraboost 21 is a premium running shoe that offers unparalleled comfort, support, and performance for runners of all levels. With its responsive Boost midsole and flexible Primeknit upper, this shoe delivers a smooth and cushioned ride with every step. The 3D heel frame provides stability and support, while the Continental Rubber outsole offers superior traction and durability on any surface. Whether you're hitting the pavement or the trails, the Adidas Ultraboost 21 is the perfect choice for your next run.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Microsoft Surface Pro 8",
    "price": 999,
    "stock": 30,
    "reviews": [],
    "brand": "Microsoft",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Microsoft Surface Pro 8 is a versatile 2-in-1 laptop that offers the power of a laptop and the versatility of a tablet in one sleek and portable device. With its vibrant PixelSense display and powerful Intel Core processor, this device delivers stunning visuals and lightning-fast performance for work, play, and everything in between. The detachable keyboard and Surface Pen (sold separately) let you switch seamlessly between laptop and tablet mode, while the adjustable kickstand allows you to find the perfect angle for typing, drawing, or watching movies. With all-day battery life and Windows 11 pre-installed, the Microsoft Surface Pro 8 is the perfect companion for productivity on the go.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Bose QuietComfort Earbuds",
    "price": 279,
    "stock": 40,
    "reviews": [],
    "brand": "Bose",
    "category": "headphone",
    "photos": [],
    "displayImage": "",
    "description": "The Bose QuietComfort Earbuds are premium true wireless earbuds that offer industry-leading noise cancellation and exceptional sound quality in a sleek and compact design. With their advanced ANC technology, these earbuds block out distractions and immerse you in your music, allowing you to focus and stay productive in any environment. The custom-designed drivers deliver deep, clear, and balanced sound, while the StayHear Max tips provide a secure and comfortable fit for all-day wear. Whether you're commuting, working out, or just relaxing at home, the Bose QuietComfort Earbuds are the perfect companion for your audio needs.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Samsung Galaxy Watch 4",
    "price": 349,
    "stock": 30,
    "reviews": [],
    "brand": "Samsung",
    "category": "watch",
    "photos": [],
    "displayImage": "",
    "description": "The Samsung Galaxy Watch 4 is a stylish and feature-packed smartwatch that helps you stay connected, motivated, and healthy throughout the day. With its sleek and modern design, this watch looks great on any wrist, while its vibrant AMOLED display provides crystal-clear visuals and easy navigation. The advanced health monitoring features track your heart rate, sleep patterns, and activity levels, giving you valuable insights into your overall well-being. With built-in GPS and 5ATM water resistance, you can track your workouts and outdoor adventures with confidence, while the long-lasting battery ensures that you can go all day without having to recharge. Whether you're at work, at the gym, or out and about, the Samsung Galaxy Watch 4 is the perfect companion for your active lifestyle.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Lenovo Legion 5 Gaming Laptop",
    "price": 1199,
    "stock": 20,
    "reviews": [],
    "brand": "Lenovo",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Lenovo Legion 5 Gaming Laptop is a powerful and affordable gaming laptop that offers high-performance gaming without breaking the bank. With its AMD Ryzen processor and NVIDIA GeForce graphics, this laptop delivers smooth and immersive gameplay with stunning visuals and responsive controls. The fast refresh rate and low response time ensure smooth and tear-free gaming, while the dual-channel memory and spacious SSD provide ample storage and fast load times for all your favorite games. Whether you're a casual gamer or a hardcore enthusiast, the Lenovo Legion 5 Gaming Laptop is the perfect choice for gaming on the go.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Canon EOS R5",
    "price": 3899,
    "stock": 10,
    "reviews": [],
    "brand": "Canon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Canon EOS R5 is a professional-grade mirrorless camera that offers unrivaled performance and versatility for photographers and videographers alike. With its 45-megapixel full-frame CMOS sensor and DIGIC X image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The advanced autofocus system with deep learning technology ensures fast and accurate subject tracking, while the in-body image stabilization system provides up to 8 stops of shake correction for sharp and steady handheld shooting. Whether you're shooting stills or videos, the Canon EOS R5 is the ultimate tool for capturing stunning visuals and telling compelling stories.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Ray-Ban Wayfarer Sunglasses",
    "price": 169,
    "stock": 50,
    "reviews": [],
    "brand": "Ray-Ban",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Ray-Ban Wayfarer Sunglasses are an iconic accessory that never goes out of style. With their timeless design and superior craftsmanship, these sunglasses are a must-have addition to any wardrobe. The classic Wayfarer shape flatters all face shapes, while the durable acetate frame provides long-lasting durability and comfort. The polarized lenses offer 100% UV protection, reducing glare and protecting your eyes from harmful rays. Whether you're hitting the beach, driving around town, or just hanging out with friends, the Ray-Ban Wayfarer Sunglasses are the perfect choice for effortless style and unbeatable sun protection.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Apple iPad Air (4th Gen)",
    "price": 599,
    "stock": 40,
    "reviews": [],
    "brand": "Apple",
    "category": "tablet",
    "photos": [],
    "displayImage": "",
    "description": "The Apple iPad Air (4th Gen) is a powerful and versatile tablet that offers the perfect balance of portability and performance. With its stunning Liquid Retina display and powerful A14 Bionic chip, this iPad delivers immersive visuals and lightning-fast performance for work, play, and everything in between. The sleek and lightweight design makes it easy to take with you wherever you go, while the Touch ID fingerprint sensor ensures secure and convenient access to your device. Whether you're browsing the web, watching movies, or sketching ideas, the Apple iPad Air (4th Gen) is the perfect companion for your everyday life.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Garmin Fenix 7",
    "price": 799,
    "stock": 30,
    "reviews": [],
    "brand": "Garmin",
    "category": "watch",
    "photos": [],
    "displayImage": "",
    "description": "The Garmin Fenix 7 is a premium multisport GPS watch that offers advanced features and durability for outdoor enthusiasts and athletes. With its rugged design and MIL-STD-810G certification, this watch is built to withstand the toughest conditions, whether you're hiking, trail running, or mountain biking. The advanced GPS and GLONASS navigation systems provide accurate tracking and mapping, while the wrist-based heart rate monitor and pulse ox sensor help you monitor your health and fitness levels in real time. With smart notifications, music streaming, and customizable watch faces, the Garmin Fenix 7 is the ultimate companion for your active lifestyle.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Levi's 501 Original Fit Jeans",
    "price": 59,
    "stock": 60,
    "reviews": [],
    "brand": "Levi's",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Levi's 501 Original Fit Jeans are a timeless classic that never goes out of style. With their iconic straight-leg silhouette and rugged denim construction, these jeans are a wardrobe staple for men and women alike. The button fly and five-pocket styling add to the vintage-inspired look, while the mid-rise waist and relaxed fit provide all-day comfort and versatility. Whether you're dressing up or keeping it casual, the Levi's 501 Original Fit Jeans are the perfect choice for effortless style and timeless appeal.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "GoPro HERO 10 Black",
    "price": 499,
    "stock": 30,
    "reviews": [],
    "brand": "GoPro",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The GoPro HERO 10 Black is the ultimate action camera for capturing epic adventures and adrenaline-fueled moments. With its stunning 5.3K video resolution and advanced HyperSmooth 4.0 stabilization, this camera delivers silky-smooth footage that's sure to impress. The powerful GP2 processor ensures fast and responsive performance, allowing you to capture every detail with clarity and precision. With built-in Wi-Fi and Bluetooth connectivity, you can easily share your photos and videos with friends and family, while the rugged and waterproof design lets you take it anywhere your adventures take you. Whether you're surfing, skiing, or skydiving, the GoPro HERO 10 Black is the perfect companion for your next adventure.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Nike Air Jordan 1",
    "price": 170,
    "stock": 40,
    "reviews": [],
    "brand": "Nike",
    "category": "fashion",
    "photos": [],
    "displayImage": "",
    "description": "The Nike Air Jordan 1 is a legendary basketball shoe that has transcended the court to become a cultural icon. With its iconic high-top silhouette and classic Air Jordan branding, this sneaker is a must-have for sneakerheads and collectors alike. The premium leather upper provides durability and support, while the Air-Sole unit in the heel delivers lightweight cushioning for all-day comfort. Whether you're rocking them on the court or the streets, the Nike Air Jordan 1 is sure to turn heads and make a statement wherever you go.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Sony PlayStation 5",
    "price": 499,
    "stock": 20,
    "reviews": [],
    "brand": "Sony",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Sony PlayStation 5 is the next-generation gaming console that takes gaming to a whole new level with its stunning graphics, lightning-fast load times, and immersive gameplay experiences. With its powerful custom-designed CPU and GPU, this console delivers breathtaking visuals and smooth performance for even the most demanding games. The lightning-fast SSD storage ensures lightning-fast load times and seamless transitions between levels, while the integrated Tempest 3D AudioTech delivers immersive sound that puts you right in the middle of the action. Whether you're a casual gamer or a hardcore enthusiast, the Sony PlayStation 5 is the ultimate gaming console for your living room.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Fitbit Charge 5",
    "price": 179,
    "stock": 40,
    "reviews": [],
    "brand": "Fitbit",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Fitbit Charge 5 is a premium fitness tracker that helps you stay motivated, track your progress, and reach your health and fitness goals. With its sleek and stylish design, this tracker looks great on any wrist, while its advanced features provide valuable insights into your overall health and well-being. The built-in GPS lets you track your outdoor activities with precision, while the heart rate monitor and SpO2 sensor monitor your heart rate and blood oxygen levels throughout the day. With up to 7 days of battery life and water resistance up to 50 meters, the Fitbit Charge 5 is the perfect companion for your active lifestyle.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Microsoft Xbox Series X",
    "price": 499,
    "stock": 20,
    "reviews": [],
    "brand": "Microsoft",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Microsoft Xbox Series X is the most powerful and immersive gaming console ever created, delivering stunning graphics, lightning-fast load times, and unparalleled performance for gamers of all levels. With its custom-designed CPU and GPU, this console delivers breathtaking visuals and smooth gameplay for even the most demanding games. The lightning-fast SSD storage ensures quick load times and seamless transitions between levels, while the innovative Xbox Velocity Architecture ensures smooth and responsive gaming experiences. Whether you're playing the latest AAA titles or revisiting classic favorites, the Microsoft Xbox Series X is the ultimate gaming console for your living room.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Canon EOS R6",
    "price": 2499,
    "stock": 10,
    "reviews": [],
    "brand": "Canon",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Canon EOS R6 is a professional-grade mirrorless camera that offers advanced features and versatility for photographers and videographers alike. With its 20-megapixel full-frame CMOS sensor and DIGIC X image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The advanced autofocus system with deep learning technology ensures fast and accurate subject tracking, while the in-body image stabilization system provides up to 8 stops of shake correction for sharp and steady handheld shooting. Whether you're shooting stills or videos, the Canon EOS R6 is the ultimate tool for capturing stunning visuals and telling compelling stories.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Bose SoundLink Revolve+",
    "price": 299,
    "stock": 30,
    "reviews": [],
    "brand": "Bose",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Bose SoundLink Revolve+ is a portable Bluetooth speaker that delivers immersive 360-degree sound and deep, powerful bass in a compact and durable design. With its seamless aluminum body and water-resistant construction, this speaker is built to withstand the rigors of outdoor adventures and poolside parties. The rechargeable battery provides up to 17 hours of playtime on a single charge, while the built-in speakerphone lets you take calls hands-free with crystal-clear sound. Whether you're lounging at home, hosting a barbecue, or hitting the beach, the Bose SoundLink Revolve+ is the perfect companion for your music.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Sony WH-1000XM4",
    "price": 349,
    "stock": 30,
    "reviews": [],
    "brand": "Sony",
    "category": "headphone",
    "photos": [],
    "displayImage": "",
    "description": "The Sony WH-1000XM4 is the ultimate wireless noise-canceling headphone, designed to deliver unparalleled audio quality and comfort. With its industry-leading noise-canceling technology, you can block out distractions and immerse yourself in your favorite music, movies, and podcasts with stunning clarity and detail. The adaptive sound control feature automatically adjusts the sound settings based on your activity and surroundings, ensuring optimal sound quality wherever you go. The ergonomic design and plush ear cushions provide all-day comfort, while the long battery life ensures that you can enjoy your music for hours on end. Whether you're commuting, traveling, or just relaxing at home, the Sony WH-1000XM4 is the perfect companion for all your audio needs.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "DJI Mavic Air 2 Drone",
    "price": 799,
    "stock": 25,
    "reviews": [],
    "brand": "DJI",
    "category": "electronics",
    "photos": [],
    "displayImage": "",
    "description": "The DJI Mavic Air 2 Drone is a compact and powerful quadcopter that offers stunning 4K video recording and 48MP photos in a portable and foldable design. With its advanced obstacle sensing technology and intelligent flight modes, this drone is perfect for capturing breathtaking aerial footage and exploring the world from a new perspective. Whether you're a beginner or an experienced pilot, the DJI Mavic Air 2 Drone is the ultimate tool for capturing your adventures and creating cinematic masterpieces.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Apple MacBook Pro (M1 Chip)",
    "price": 1799,
    "stock": 15,
    "reviews": [],
    "brand": "Apple",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Apple MacBook Pro with M1 Chip is a revolutionary laptop that redefines performance and efficiency. With its powerful M1 chip, this laptop delivers blazing-fast performance for everyday tasks and demanding workflows alike. The stunning Retina display brings your content to life with vibrant colors and sharp detail, while the long battery life ensures that you can work and play all day without needing to recharge. Whether you're editing photos, coding software, or streaming movies, the Apple MacBook Pro with M1 Chip is the ultimate tool for creativity and productivity.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Samsung Galaxy S22 Ultra",
    "price": 1199,
    "stock": 20,
    "reviews": [],
    "brand": "Samsung",
    "category": "smartphone",
    "photos": [],
    "displayImage": "",
    "description": "The Samsung Galaxy S22 Ultra is a premium smartphone that offers the perfect combination of power, performance, and versatility. With its stunning Infinity-O display and advanced camera system, this phone lets you capture every moment with stunning clarity and detail. The powerful Exynos processor and ample RAM ensure smooth multitasking and responsive performance, while the long-lasting battery keeps you connected all day long. Whether you're gaming, streaming, or just browsing the web, the Samsung Galaxy S22 Ultra is the perfect companion for your digital lifestyle.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Microsoft Surface Laptop Studio",
    "price": 1599,
    "stock": 15,
    "reviews": [],
    "brand": "Microsoft",
    "category": "laptop",
    "photos": [],
    "displayImage": "",
    "description": "The Microsoft Surface Laptop Studio is a versatile and powerful laptop that adapts to your needs with ease. With its innovative design and flexible form factor, this laptop seamlessly transitions between laptop, studio, and tablet modes, allowing you to work, create, and play however you want. The vibrant PixelSense display and powerful Intel Core processor deliver stunning visuals and lightning-fast performance, while the Surface Pen (sold separately) lets you sketch, annotate, and take notes with precision and accuracy. Whether you're a student, a professional, or a creative enthusiast, the Microsoft Surface Laptop Studio is the ultimate tool for unleashing your creativity and productivity.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Sony Alpha A7 IV Mirrorless Camera",
    "price": 2499,
    "stock": 10,
    "reviews": [],
    "brand": "Sony",
    "category": "camera",
    "photos": [],
    "displayImage": "",
    "description": "The Sony Alpha A7 IV Mirrorless Camera is a professional-grade camera that offers uncompromising performance and versatility for photographers and videographers alike. With its 33-megapixel full-frame Exmor R CMOS sensor and BIONZ XR image processor, this camera delivers stunning image quality and fast performance, allowing you to capture every moment with precision and clarity. The advanced autofocus system with real-time tracking ensures sharp focus, even on fast-moving subjects, while the in-body image stabilization system provides up to 5.5 stops of shake correction for smooth and steady handheld shooting. Whether you're shooting stills or videos, the Sony Alpha A7 IV Mirrorless Camera is the ultimate tool for capturing stunning visuals and telling compelling stories.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Bose Frames Audio Sunglasses",
    "price": 199,
    "stock": 30,
    "reviews": [],
    "brand": "Bose",
    "category": "accessories",
    "photos": [],
    "displayImage": "",
    "description": "The Bose Frames Audio Sunglasses are a revolutionary wearable device that combines sunglasses with built-in speakers for an immersive audio experience. With their stylish and lightweight design, these sunglasses look and feel like traditional eyewear, while delivering rich and immersive sound directly to your ears. The advanced Bluetooth connectivity lets you stream music, take calls, and access virtual assistants with ease, while the polarized lenses provide 100% UV protection and reduce glare for clear and comfortable vision in any environment. Whether you're relaxing at the beach, commuting to work, or enjoying outdoor activities, the Bose Frames Audio Sunglasses are the perfect companion for your active lifestyle.",
    "vendor": "vendor3",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Samsung 49-Inch Odyssey G9 Gaming Monitor",
    "price": 1499,
    "stock": 10,
    "reviews": [],
    "brand": "Samsung",
    "category": "monitor",
    "photos": [],
    "displayImage": "",
    "description": "The Samsung 49-Inch Odyssey G9 Gaming Monitor is a cutting-edge display that offers immersive gaming experiences and stunning visuals for gamers and content creators alike. With its ultra-wide 32:9 aspect ratio and QLED technology, this monitor delivers crisp detail and vibrant colors across the entire screen, bringing games, movies, and content to life like never before. The lightning-fast refresh rate and response time ensure smooth and fluid gameplay with minimal motion blur and input lag, while the customizable ambient lighting adds a touch of style to your gaming setup. Whether you're gaming, streaming, or working, the Samsung 49-Inch Odyssey G9 Gaming Monitor is the ultimate choice for immersive entertainment and productivity.",
    "vendor": "vendor1",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  },
  {
    "title": "Fender American Professional II Stratocaster Electric Guitar",
    "price": 1499,
    "stock": 15,
    "reviews": [],
    "brand": "Fender",
    "category": "musical instrument",
    "photos": [],
    "displayImage": "",
    "description": "The Fender American Professional II Stratocaster Electric Guitar is a classic instrument that offers timeless tone, style, and playability for guitarists of all skill levels. With its iconic double-cutaway body and comfortable C-shaped neck, this guitar is perfect for playing a wide range of musical styles, from blues and rock to jazz and country. The trio of V-Mod II single-coil pickups deliver classic Stratocaster tones with modern clarity and articulation, while the treble bleed circuit ensures that your tone remains clear and present at any volume. Whether you're recording in the studio or performing on stage, the Fender American Professional II Stratocaster Electric Guitar is the perfect companion for unleashing your creativity and expressing your musical voice.",
    "vendor": "vendor2",
    "runningDiscount": 0,
    "releaseDate": "2024-03-10"
  }
]
